Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/include/component/dmac.h
#define DMAC_PRICTRL0_LVLPRI0_Pos             _UINT32_(0)                                          /* (DMAC_PRICTRL0) Level 0 Channel Priority Number Position */
#define DMAC_PRICTRL0_LVLPRI0_Msk             (_UINT32_(0xF) << DMAC_PRICTRL0_LVLPRI0_Pos)         /* (DMAC_PRICTRL0) Level 0 Channel Priority Number Mask */
#define DMAC_PRICTRL0_LVLPRI0(value)          (DMAC_PRICTRL0_LVLPRI0_Msk & (_UINT32_(value) << DMAC_PRICTRL0_LVLPRI0_Pos)) /* Assigment of value for LVLPRI0 in the DMAC_PRICTRL0 register */
#define DMAC_PRICTRL0_RRLVLEN0_Pos            _UINT32_(7)                                          /* (DMAC_PRICTRL0) Level 0 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL0_RRLVLEN0_Msk            (_UINT32_(0x1) << DMAC_PRICTRL0_RRLVLEN0_Pos)        /* (DMAC_PRICTRL0) Level 0 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL0_RRLVLEN0(value)         (DMAC_PRICTRL0_RRLVLEN0_Msk & (_UINT32_(value) << DMAC_PRICTRL0_RRLVLEN0_Pos)) /* Assigment of value for RRLVLEN0 in the DMAC_PRICTRL0 register */
#define   DMAC_PRICTRL0_RRLVLEN0_STATIC_LVL_Val _UINT32_(0x0)                                        /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 0 priority  */
#define   DMAC_PRICTRL0_RRLVLEN0_ROUND_ROBIN_LVL_Val _UINT32_(0x1)                                        /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 0 priority  */
#define DMAC_PRICTRL0_RRLVLEN0_STATIC_LVL     (DMAC_PRICTRL0_RRLVLEN0_STATIC_LVL_Val << DMAC_PRICTRL0_RRLVLEN0_Pos) /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 0 priority Position  */
#define DMAC_PRICTRL0_RRLVLEN0_ROUND_ROBIN_LVL (DMAC_PRICTRL0_RRLVLEN0_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL0_RRLVLEN0_Pos) /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 0 priority Position  */
#define DMAC_PRICTRL0_LVLPRI1_Pos             _UINT32_(8)                                          /* (DMAC_PRICTRL0) Level 1 Channel Priority Number Position */
#define DMAC_PRICTRL0_LVLPRI1_Msk             (_UINT32_(0xF) << DMAC_PRICTRL0_LVLPRI1_Pos)         /* (DMAC_PRICTRL0) Level 1 Channel Priority Number Mask */
#define DMAC_PRICTRL0_LVLPRI1(value)          (DMAC_PRICTRL0_LVLPRI1_Msk & (_UINT32_(value) << DMAC_PRICTRL0_LVLPRI1_Pos)) /* Assigment of value for LVLPRI1 in the DMAC_PRICTRL0 register */
#define DMAC_PRICTRL0_RRLVLEN1_Pos            _UINT32_(15)                                         /* (DMAC_PRICTRL0) Level 1 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL0_RRLVLEN1_Msk            (_UINT32_(0x1) << DMAC_PRICTRL0_RRLVLEN1_Pos)        /* (DMAC_PRICTRL0) Level 1 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL0_RRLVLEN1(value)         (DMAC_PRICTRL0_RRLVLEN1_Msk & (_UINT32_(value) << DMAC_PRICTRL0_RRLVLEN1_Pos)) /* Assigment of value for RRLVLEN1 in the DMAC_PRICTRL0 register */
#define   DMAC_PRICTRL0_RRLVLEN1_STATIC_LVL_Val _UINT32_(0x0)                                        /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 1 priority  */
#define   DMAC_PRICTRL0_RRLVLEN1_ROUND_ROBIN_LVL_Val _UINT32_(0x1)                                        /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 1 priority  */
#define DMAC_PRICTRL0_RRLVLEN1_STATIC_LVL     (DMAC_PRICTRL0_RRLVLEN1_STATIC_LVL_Val << DMAC_PRICTRL0_RRLVLEN1_Pos) /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 1 priority Position  */
#define DMAC_PRICTRL0_RRLVLEN1_ROUND_ROBIN_LVL (DMAC_PRICTRL0_RRLVLEN1_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL0_RRLVLEN1_Pos) /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 1 priority Position  */
#define DMAC_PRICTRL0_LVLPRI2_Pos             _UINT32_(16)                                         /* (DMAC_PRICTRL0) Level 2 Channel Priority Number Position */
#define DMAC_PRICTRL0_LVLPRI2_Msk             (_UINT32_(0xF) << DMAC_PRICTRL0_LVLPRI2_Pos)         /* (DMAC_PRICTRL0) Level 2 Channel Priority Number Mask */
#define DMAC_PRICTRL0_LVLPRI2(value)          (DMAC_PRICTRL0_LVLPRI2_Msk & (_UINT32_(value) << DMAC_PRICTRL0_LVLPRI2_Pos)) /* Assigment of value for LVLPRI2 in the DMAC_PRICTRL0 register */
#define DMAC_PRICTRL0_RRLVLEN2_Pos            _UINT32_(23)                                         /* (DMAC_PRICTRL0) Level 2 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL0_RRLVLEN2_Msk            (_UINT32_(0x1) << DMAC_PRICTRL0_RRLVLEN2_Pos)        /* (DMAC_PRICTRL0) Level 2 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL0_RRLVLEN2(value)         (DMAC_PRICTRL0_RRLVLEN2_Msk & (_UINT32_(value) << DMAC_PRICTRL0_RRLVLEN2_Pos)) /* Assigment of value for RRLVLEN2 in the DMAC_PRICTRL0 register */
#define   DMAC_PRICTRL0_RRLVLEN2_STATIC_LVL_Val _UINT32_(0x0)                                        /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 2 priority  */
#define   DMAC_PRICTRL0_RRLVLEN2_ROUND_ROBIN_LVL_Val _UINT32_(0x1)                                        /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 2 priority  */
#define DMAC_PRICTRL0_RRLVLEN2_STATIC_LVL     (DMAC_PRICTRL0_RRLVLEN2_STATIC_LVL_Val << DMAC_PRICTRL0_RRLVLEN2_Pos) /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 2 priority Position  */
#define DMAC_PRICTRL0_RRLVLEN2_ROUND_ROBIN_LVL (DMAC_PRICTRL0_RRLVLEN2_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL0_RRLVLEN2_Pos) /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 2 priority Position  */
#define DMAC_PRICTRL0_LVLPRI3_Pos             _UINT32_(24)                                         /* (DMAC_PRICTRL0) Level 3 Channel Priority Number Position */
#define DMAC_PRICTRL0_LVLPRI3_Msk             (_UINT32_(0xF) << DMAC_PRICTRL0_LVLPRI3_Pos)         /* (DMAC_PRICTRL0) Level 3 Channel Priority Number Mask */
#define DMAC_PRICTRL0_LVLPRI3(value)          (DMAC_PRICTRL0_LVLPRI3_Msk & (_UINT32_(value) << DMAC_PRICTRL0_LVLPRI3_Pos)) /* Assigment of value for LVLPRI3 in the DMAC_PRICTRL0 register */
#define DMAC_PRICTRL0_RRLVLEN3_Pos            _UINT32_(31)                                         /* (DMAC_PRICTRL0) Level 3 Round-Robin Scheduling Enable Position */
#define DMAC_PRICTRL0_RRLVLEN3_Msk            (_UINT32_(0x1) << DMAC_PRICTRL0_RRLVLEN3_Pos)        /* (DMAC_PRICTRL0) Level 3 Round-Robin Scheduling Enable Mask */
#define DMAC_PRICTRL0_RRLVLEN3(value)         (DMAC_PRICTRL0_RRLVLEN3_Msk & (_UINT32_(value) << DMAC_PRICTRL0_RRLVLEN3_Pos)) /* Assigment of value for RRLVLEN3 in the DMAC_PRICTRL0 register */
#define   DMAC_PRICTRL0_RRLVLEN3_STATIC_LVL_Val _UINT32_(0x0)                                        /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 3 priority  */
#define   DMAC_PRICTRL0_RRLVLEN3_ROUND_ROBIN_LVL_Val _UINT32_(0x1)                                        /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 3 priority  */
#define DMAC_PRICTRL0_RRLVLEN3_STATIC_LVL     (DMAC_PRICTRL0_RRLVLEN3_STATIC_LVL_Val << DMAC_PRICTRL0_RRLVLEN3_Pos) /* (DMAC_PRICTRL0) Static arbitration scheme for channels with level 3 priority Position  */
#define DMAC_PRICTRL0_RRLVLEN3_ROUND_ROBIN_LVL (DMAC_PRICTRL0_RRLVLEN3_ROUND_ROBIN_LVL_Val << DMAC_PRICTRL0_RRLVLEN3_Pos) /* (DMAC_PRICTRL0) Round-robin arbitration scheme for channels with level 3 priority Position  */
#define DMAC_PRICTRL0_Msk                     _UINT32_(0x8F8F8F8F)                                 /* (DMAC_PRICTRL0) Register Mask  */


